#include "head.h"
#include "LOGIC_public.h"
#include "VIEW_admin.h"

/*****************************************************************************************************************
* 函数名称：void AdminView()
* 功能描述：
*			 实现 管理员界面 的功能  
* 参数说明：
*           
* 返回值：
******************************************************************************************************************/

void AdminView()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t    管理员界面\n\n");
		printf("\t\t\t\t     版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\t\t\t   ╔═════════════╗\n");
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║      ☆1.增加用户        ║\n");		//坐标（36,13）
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║      ☆2.查询用户        ║\n");
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║      ☆3.删除用户        ║\n");
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║      ☆4.修改密码        ║\n");
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║      ☆5.恢复用户        ║\n");
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ╚═════════════╝\n");
		gotoxy(0,23);
		printf("Esc:返回");
		gotoxy(26,22);
		printf( " ╔═════════════╗\n");
		gotoxy(26,23);
		printf( " ║ ↑向上 Enter 选择 ↓向下 ║\n");
		gotoxy(26,24);
		printf( " ╚═════════════╝\n");
		gotoxy(72,23);
		printf("Q:退出");
		gotoxy(36,13);
}


/*****************************************************************************************************************
* 函数名称：void AdminAdd_View()
* 功能描述：
*			 实现 管理员添加用户界面 的功能  
* 参数说明：
*           
* 返回值：
******************************************************************************************************************/

void AdminAdd_View()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t管理员---增加用户界面\n\n");
		printf("\t\t\t\t   版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\n\n");
}


/*****************************************************************************************************************
* 函数名称：void AdminQuery_View()
* 功能描述：
*			 实现 管理员查询用户界面 的功能  
* 参数说明：
*           
* 返回值：
******************************************************************************************************************/

void AdminQuery_View()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t管理员---用户查询界面\n\n");
		printf("\t\t\t\t     版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\t\t\t   ╔═════════════╗\n");
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║      ☆1.全部查询        ║\n");		//坐标（36,13）
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║      ☆2.分类查询        ║\n");
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║      ☆3.条件查询        ║\n");
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║      ☆4.用户密码查询    ║\n");
		printf("\t\t\t   ║                          ║\n");	
		printf("\t\t\t   ╚═════════════╝\n");
		gotoxy(0,23);
		printf("Esc:返回登陆界面");
		gotoxy(30,23);
		printf("↑向上 ↓向下 enter 选择 ");
		gotoxy(72,23);
		printf("Q:退出系统");
		gotoxy(36,13);
}


/*****************************************************************************************************************
* 函数名称：void AdminAllquery_View()
* 功能描述：
*			 实现 全部查询界面 的功能  
* 参数说明：
*           
* 返回值：
******************************************************************************************************************/

void AdminAllquery_View()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t管理员---全部查询界面\n\n");
		printf("\t\t\t\t   版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\n\n");
}


/*****************************************************************************************************************
* 函数名称：void AdminClassifyQuery_View()
* 功能描述：
*			 实现 管理员分类查询界面 的功能  
* 参数说明：
*           
* 返回值：
******************************************************************************************************************/

void AdminClassifyQuery_View()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t管理员---分类查询界面\n\n");
		printf("\t\t\t\t     版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\t\t\t   ╔═════════════╗\n");
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║      ☆1.管理员查询      ║\n");		//坐标（36,13）
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║      ☆2.普通用户查询    ║\n");
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║                          ║\n");	
		printf("\t\t\t   ╚═════════════╝\n");
		gotoxy(0,23);
		printf("Esc:返回");
		gotoxy(30,23);
		printf("↑向上 ↓向下 enter 选择 ");
		gotoxy(72,23);
		printf("Q:退出");
		gotoxy(36,13);
}


/*****************************************************************************************************************
* 函数名称：void AdminConditionquery_View()
* 功能描述：
*			 实现 条件查询界面 的功能  
* 参数说明：
*           
* 返回值：
******************************************************************************************************************/

void AdminConditionquery_View()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t管理员---条件查询界面\n\n");
		printf("\t\t\t\t     版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\t\t\t   ╔═════════════╗\n");
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║      ☆1.模糊查询        ║\n");		//坐标（36,13）
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║      ☆2.精确查询        ║\n");
		printf("\t\t\t   ║                          ║\n");
		printf("\t\t\t   ║                          ║\n");	
		printf("\t\t\t   ╚═════════════╝\n");
		gotoxy(0,23);
		printf("Esc:返回");
		gotoxy(30,23);
		printf("↑向上 ↓向下 enter 选择 ");
		gotoxy(72,23);
		printf("Q:退出");
		gotoxy(36,13);
}


/*****************************************************************************************************************
* 函数名称：void AdminAquery_View()
* 功能描述：
*			 实现 查询管理员界面 的功能  
* 参数说明：
*           
* 返回值：
******************************************************************************************************************/

void AdminAquery_View()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t管理员---查询管理员界面\n\n");
		printf("\t\t\t\t   版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\n\n");
}


/*****************************************************************************************************************
* 函数名称：void AdminUquery_View()
* 功能描述：
*			 实现 查询普通用户界面 的功能  
* 参数说明：
*           
* 返回值：
******************************************************************************************************************/

void AdminUquery_View()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t管理员---查询普通用户界面\n\n");
		printf("\t\t\t\t   版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\n\n");
}


/*****************************************************************************************************************
* 函数名称：void AdminExactsearch_View()
* 功能描述：
*			 实现 精确查询用户界面 的功能  
* 参数说明：
*           
* 返回值：
******************************************************************************************************************/

void AdminExactsearch_View()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t管理员---精确查询界面\n\n");
		printf("\t\t\t\t   版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\n\n");
}


/*****************************************************************************************************************
* 函数名称：void AdminVaguesearch_View()
* 功能描述：
*			 实现 模糊查询用户界面 的功能  
* 参数说明：
*           
* 返回值：
******************************************************************************************************************/

void AdminVaguesearch_View()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t管理员---模糊查询界面\n\n");
		printf("\t\t\t\t   版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\n\n");
}


/*****************************************************************************************************************
* 函数名称：void AdminDel_View()
* 功能描述：
*			 实现 管理员删除用户界面 的功能  
* 参数说明：
*           
* 返回值：
******************************************************************************************************************/

void AdminDel_View()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t管理员---删除用户界面\n\n");
		printf("\t\t\t\t   版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\n\n");
}


/*****************************************************************************************************************
* 函数名称：void AdminUpdpsw_View()
* 功能描述：
*			 实现 管理员修改密码界面 的功能  
* 参数说明：
*           
* 返回值：
******************************************************************************************************************/

void AdminUpdpsw_View()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t管理员---修改密码界面\n\n");
		printf("\t\t\t\t   版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\n\n");
		gotoxy(0,23);
		printf("Esc:返回");
		gotoxy(20,13);
}

/*****************************************************************************************************************
* 函数名称：void AdminRecover_View()
* 功能描述：
*			 实现 管理员修改密码界面 的功能  
* 参数说明：
*           
* 返回值：
******************************************************************************************************************/

void AdminRecover_View()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t管理员---恢复用户界面\n\n");
		printf("\t\t\t\t   版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\n\n");
}



void AdminPassword_View()
{
		system("cls");
		printf("\n\n\t\t*************************************************\n\n");
		printf("\t\t\t\t管理员---密码查询界面\n\n");
		printf("\t\t\t\t   版本 2.0\n\n");
		printf("\t\t*************************************************\n\n\n");
		printf("\n\n");
}